

# Дана сторона квадрата a. Найти его периметр P = 4·a

a = int(input("Enter side: "))
num = 4
p = num * a
print(p)


# Дана сторона квадрата a. Найти его площадь{{ S = a2}}

a = int(input("Enter side: "))
s = num**2
print(s)
# Даны стороны прямоугольника a и b. Найти его площадь S = a·b и периметр P = 2·(a + b)

# Дан диаметр окружности d. Найти ее длину{{ L = π·d, π = 3.14}}

# Дана длина ребра куба a. Найти объем куба V = a3 и площадь его поверхности S = 6·a2

# Даны длины ребер a, b, c прямоугольного параллелепипеда. Найти его объем V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c)

# Найти длину окружности L и площадь круга S заданного радиуса R: L = 2·π·R, S = π·R2, π=3.14

# Даны два числа a и b. Найти их среднее арифметическое: (a + b)/2

# Даны два неотрицательных числа a и b. Найти их среднее геометрическое, т. е. квадратный корень из их произведения: (a·b)1/2

# Даны два ненулевых числа. Найти сумму, разность, произведение и частное их квадратов.