

# Дана сторона квадрата a. Найти его периметр P = 4·a

a = int(input("Enter side: "))
num = 4
p = num * a
print(p)